<template>
      <div class="notice">
          <header>国家网络安全宣传周活动方案</header>
          <main>
            <header>
              <div class="user">
                <i class="icon iconfont">&#xe611;</i>
                <span>系统管理员</span>
              </div>
              <div class="time">
                <i class="icon iconfont">&#xe6e8;</i>
                <span>2017-08-31 18:30:13</span>
              </div>
            </header>
            <article>
              主编正色地说：“阿笙，我知道一个中国人在美国当一个摄影师多么的难，你必须比大多数白人优秀。他们总以为我们中国人是没有艺术细胞的。”

就这样安定下来，她仍然去那家超市购物，却再也没有遇见过他们。直到有一次，超市的保安叫住了她。

“小姐，请你到保安室来一趟。”

默笙一愣，直觉没有好事，报纸上有太多的关于超市保安强行搜身甚至打人的报道。

默笙谨慎地盯着他，保安无奈地说：“小姐，我对你没有恶意，只是想问你一个月前有没有丢了东西。”

一个月前她刚回国，难道她丢了什么自己也不知道？好奇地随他走进保安室，保安递给她一个黑色的皮夹。

默笙不用看里面就知道不是自己的，笑着摇摇头说：“你弄错了，这不是我的。”

保安出乎意料地固执：“你打开来看看。”

她接过打开，然后看到了自己的照片。

保安得意地说：“小姐，这是你的照片吧，虽然和现在差别很大，可我还是一眼就认出来了。”

差别是很大的，因为那是刚上大学时拍的入学照。她还是长长的头发扎成马尾，傻乎乎地笑着。

怎么会出现在一个陌生的皮夹里？

默笙把皮夹还给保安：“这的确不是我的。”

保安傻傻的：“照片上的人不是你吗？”

“是我，可是皮夹不是我的。”

“可一定是认识你的人的，小姐，说不定这个皮夹的主人暗恋你……”

哎，谁说中国人没有联想力的？

“可是……”

“你拿去吧拿去吧，一直没人来认领，放在这里我们也很难处理，交上去也是充公，还不如给你，你和皮夹的主人肯定有点关联。啊！说不定我还促成了一段美好姻缘呢……”保安沉浸在电视连续剧似的想像里。

一个月前，大约也是她碰到何以琛何以玫的时候，会是他掉的吗？怀着这样可笑的猜测，默笙把皮夹拿回了家。

晚上洗完澡在床上仔细地研究它，简单的式样，名贵的牌子，现金不多，完全不能确定失主的身份。

而那张照片，默笙小心地取出来，上面还有钢印的痕迹，应该是从什么证件上撕下来的。无意地翻过来，她突然怔住，背后有字！那潇洒凌厉得仿佛要破纸而出的字迹她一辈子都不会忘记。

那是以琛的笔迹，用黑色钢笔写着——

my sunshine！

复杂城市里的生活一样可以过得很单纯，工作、吃和睡，如此而已。一段忙乱的适应期后，接下来就是麻木的重复。

“阿笙啊，我到处找你。”

默笙刚踏入杂志社，就听到老远有人在喊。

“老白，有什么事情？”

老白其实很年轻，是杂志社的另一个摄影师，姓李，因为老说白字所以大家戏称他老白。他哄明星很有一套，所以杂志封面人物的拍摄都由他负责。

“我老婆要生了，明天帮萧大模特拍照的事能不能麻烦你？”

萧筱？默笙有点为难，“我是没什么问题，但听说萧筱的脾气很怪，不是熟人根本不配合。”

老白也想到了这一点，想了想说：“这样吧，你先去试试，如果实在不行再叫我。”

第二天，当默笙见到冷艳动人的萧筱时，她完全呆住了。她对国内的明星不熟，以前从来没有见过萧筱的照片，不知道她竟然……竟然跟她大学时代的好友长得那么像。

可她的好友是那样一个纯朴而笨拙的农村姑娘，眼前的人却跷着修长的玉腿，抽烟的动作熟练而妩媚……
主编正色地说：“阿笙，我知道一个中国人在美国当一个摄影师多么的难，你必须比大多数白人优秀。他们总以为我们中国人是没有艺术细胞的。”

就这样安定下来，她仍然去那家超市购物，却再也没有遇见过他们。直到有一次，超市的保安叫住了她。

“小姐，请你到保安室来一趟。”

默笙一愣，直觉没有好事，报纸上有太多的关于超市保安强行搜身甚至打人的报道。

默笙谨慎地盯着他，保安无奈地说：“小姐，我对你没有恶意，只是想问你一个月前有没有丢了东西。”

一个月前她刚回国，难道她丢了什么自己也不知道？好奇地随他走进保安室，保安递给她一个黑色的皮夹。

默笙不用看里面就知道不是自己的，笑着摇摇头说：“你弄错了，这不是我的。”

保安出乎意料地固执：“你打开来看看。”

她接过打开，然后看到了自己的照片。

保安得意地说：“小姐，这是你的照片吧，虽然和现在差别很大，可我还是一眼就认出来了。”

差别是很大的，因为那是刚上大学时拍的入学照。她还是长长的头发扎成马尾，傻乎乎地笑着。

怎么会出现在一个陌生的皮夹里？

默笙把皮夹还给保安：“这的确不是我的。”

保安傻傻的：“照片上的人不是你吗？”

“是我，可是皮夹不是我的。”

“可一定是认识你的人的，小姐，说不定这个皮夹的主人暗恋你……”

哎，谁说中国人没有联想力的？

“可是……”

“你拿去吧拿去吧，一直没人来认领，放在这里我们也很难处理，交上去也是充公，还不如给你，你和皮夹的主人肯定有点关联。啊！说不定我还促成了一段美好姻缘呢……”保安沉浸在电视连续剧似的想像里。

一个月前，大约也是她碰到何以琛何以玫的时候，会是他掉的吗？怀着这样可笑的猜测，默笙把皮夹拿回了家。

晚上洗完澡在床上仔细地研究它，简单的式样，名贵的牌子，现金不多，完全不能确定失主的身份。

而那张照片，默笙小心地取出来，上面还有钢印的痕迹，应该是从什么证件上撕下来的。无意地翻过来，她突然怔住，背后有字！那潇洒凌厉得仿佛要破纸而出的字迹她一辈子都不会忘记。

那是以琛的笔迹，用黑色钢笔写着——

my sunshine！

复杂城市里的生活一样可以过得很单纯，工作、吃和睡，如此而已。一段忙乱的适应期后，接下来就是麻木的重复。

“阿笙啊，我到处找你。”

默笙刚踏入杂志社，就听到老远有人在喊。

“老白，有什么事情？”

老白其实很年轻，是杂志社的另一个摄影师，姓李，因为老说白字所以大家戏称他老白。他哄明星很有一套，所以杂志封面人物的拍摄都由他负责。

“我老婆要生了，明天帮萧大模特拍照的事能不能麻烦你？”

萧筱？默笙有点为难，“我是没什么问题，但听说萧筱的脾气很怪，不是熟人根本不配合。”

老白也想到了这一点，想了想说：“这样吧，你先去试试，如果实在不行再叫我。”

第二天，当默笙见到冷艳动人的萧筱时，她完全呆住了。她对国内的明星不熟，以前从来没有见过萧筱的照片，不知道她竟然……竟然跟她大学时代的好友长得那么像。

可她的好友是那样一个纯朴而笨拙的农村姑娘，眼前的人却跷着修长的玉腿，抽烟的动作熟练而妩媚……
            </article>
          </main>
          <footer>发布：<span>2017-08-31</span></footer>
      </div>
</template>
<script>
    export default{
      data(){
          return {
            header:"",
            footer:"",
            //main:"",
            user:"",
            time:""
          }
      },
      mounted(){
        this.getDetail();
      },
      methods:{
          getDetail(){
            $.ajax({
              type:"get",
              url:"../../static/json/detail.json",
              success:function (result) {
                this.header = result.header;
                this.footer = result.footer;
              }
            })
          }
      }
    }
</script>
<style>
  .notice{
    width: 100%;
    height:100%;
    font-family: "微软雅黑";
  }
  .notice>header{
    display: -webkit-flex;
    display: flex;
    align-items: center;
    width: 100%;
    height:8%;
    padding:0 3%;
    font-size:0.4rem;
    font-weight:600;
    border-bottom: 1px solid #dadada;
  }
  .notice>main{
    height:85%;
    padding: 0 3%;
    overflow: hidden;
  }
  .notice>main>header{
    display: -webkit-flex;
    display: flex;
    align-items: center;
    justify-content:space-between;
    height: 8%;
    font-size: 0.35rem;
  }
  .notice>main>header .user{
    color: #122279;
  }
  .notice>main>header .time{
    color: #b7b7b7;
  }
  .notice>main>article{
    height: 92%;
    color: #666;
    letter-spacing: 2px;
    font-size: 0.35rem;
    overflow: scroll;
  }
  .notice>footer{
    display: -webkit-flex;
    display: flex;
    align-items: center;
    justify-content:flex-end;
    width:100%;
    height:7%;
    float:right;
    padding-right:3%;
    color: #999;
    border-top:1px solid #dadada;
    border-bottom:1px solid #dadada;
    box-sizing: border-box;
  }
</style>
